package Chapter_7;
/*
Object clone () Создает новый объект, аналогичный клонируемому объекту
boolean equals (Object объект) Определяет равнозначность объектов
void finalize () Вызывается перед тем, кок неиспользуемый объект будет удален системой "сборки мусора"
Class<?> getClass () Определяет класс объекта во время выполнения
int hashCode () Возвращает хеш-код, связанный с вызывающим объектом
void notify () Возобновляет роботу потока, ожидающего уведомления от вы­зывающего объекта
void notifyAll () Возобновляет роботу всех потоков, ожидающих уведомленияот вызывающего объекта
String toString () Возвращает символьную строку, описывающую объект
void wait () Ожидает исполнения другого потока
void wait ( long миллисекунды)
void wait (long миллисекунды,
int наносекунды)
*/
public class Object_method {

}
